In [5]:
import numpy as np

In [1]:
# import pandas library.
import pandas as pd

# Pandas Series
1. Series.   (Row Wise) - 1 Dimensional. 
2. Data Frames. (Column Wise) - 2 Dimensional.

## Series

### Creating series using List

In [2]:
 l = ["banana", 42]
s = pd.Series(l)
print(s)

0    banana
1        42
dtype: object

In the above out put 0 and 1 are called row index numbers.   

By default row index number and row index name are same. In the above example row index number and row index name are 0 for banana and 1 for 42.

In [3]:
l = ["banana", 42]

s = pd.Series(l, index=["a", "b"])

print(s)

a    banana
b        42
dtype: object

In the above example row index number are still 0 and 1 (not visible in output) but the row index name are changed to "a" for banana and "b" for 42.

### Creating Series using Array.

In [7]:
a = np.array(l)

print(a)

s = pd.Series(a, index=["a", "b"])

print(s)

['banana' '42']
a    banana
b        42
dtype: object

### Creating Series using Dictionary.

In [8]:
d = {"a" : 1, "b" : 2, "c" : 3}

s = pd.Series(d)

print(s)

a    1
b    2
c    3
dtype: int64

In [12]:
d = {"a" : 1, "b" : 2, "c" : 3}

s = pd.Series(d, index=["a","c"])

print(s)    # printing using index.

a    1
c    3
dtype: int64

In [14]:
d = { "col1" : [1,2], "col2" : [3,4]}

df = pd.Series(d)

print(df)

col1    [1, 2]
col2    [3, 4]
dtype: object

## Data Frame --> Pandas.DataFrame

### Creating DataFrame using Dictionary

In [19]:
d = { "col1" : [1,2], "col2" : [3,4]}

df = pd.DataFrame(d)

df

   col1  col2
0     1     3
1     2     4

### Creating DataFrame using Nested List or 2D Array
- Data frames can not be created with 1 dimentional array.

In [18]:
d = [[1,2,3],[4,5,6]]
df1 = pd.DataFrame(d,columns=["col1","col2","col3"])
df1

   col1  col2
0     1     3
1     2     4

   col1  col2  col3
0     1     2     3
1     4     5     6

In [20]:
type(df1)

pandas.core.frame.DataFrame

In [21]:
df1.shape

(2, 3)

### Add a column

In [22]:
df1["col4"] = [120,140]

df1

   col1  col2  col3  col4
0     1     2     3   120
1     4     5     6   140

In [24]:
df1["col5"] = [180,"Null"]

df1                 # We can not just assing df1["col5"] = [180]  - This i will through error. We need to specify the missing value too.

   col1  col2  col3  col4  col5
0     1     2     3   120   180
1     4     5     6   140  Null

In [25]:
temperature_df = pd.DataFrame({"city": ["mumbai", "delhi", "banglore", "hyderabad"], "temperature": [32,45,40,36]})

temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           40
3  hyderabad           36

In [36]:
humidity_df = pd.DataFrame({"city": ["delhi", "mumbai", "banglore", "chennai"], "humidity": [60,50,55,70]})

humidity_df

       city  humidity
0     delhi        60
1    mumbai        50
2  banglore        55
3   chennai        70

### Combaining DataFrames

In [37]:
## Option 1: Append  (is used only to combine two tables)

df = temperature_df.append(humidity_df)

df

/var/folders/m_/0sjrbfvs43jdhs_tkhk_sbqc0000gn/T/ipykernel_86349/3739625124.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = temperature_df.append(humidity_df)

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
0      delhi          NaN      60.0
1     mumbai          NaN      50.0
2   banglore          NaN      55.0
3    chennai          NaN      70.0

In [38]:
## Option 2: Concatenate (multiple data frames can be concated) , by default its done row wise, i.e first table is under second table. 

df = pd.concat([temperature_df, humidity_df])

df

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
0      delhi          NaN      60.0
1     mumbai          NaN      50.0
2   banglore          NaN      55.0
3    chennai          NaN      70.0

In [40]:
# When you provide axis=1 the concate will happen side by side. 

df = pd.concat([temperature_df, humidity_df], axis=1)

df

        city  temperature      city  humidity
0     mumbai           32     delhi        60
1      delhi           45    mumbai        50
2   banglore           40  banglore        55
3  hyderabad           36   chennai        70

In [43]:
# In the axis = 0 example the index numbers are repeated. If you use ignore_index=True the index will not repeat. 

df = pd.concat([temperature_df, humidity_df], ignore_index=True)

df

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
4      delhi          NaN      60.0
5     mumbai          NaN      50.0
6   banglore          NaN      55.0
7    chennai          NaN      70.0

### Merging the DataFrame - Very Very Very important topic. 

- merge in pandas is equal to joins in SQL

In [44]:
#Outer merge -all the records of both data frames (on = will tell based on which column).

df = pd.merge(temperature_df, humidity_df, on="city", how="outer")

df

        city  temperature  humidity
0     mumbai         32.0      50.0
1      delhi         45.0      60.0
2   banglore         40.0      55.0
3  hyderabad         36.0       NaN
4    chennai          NaN      70.0

In [49]:
# Inner Merge -- Common data records only. 

df = pd.merge(temperature_df, humidity_df, on="city", how="inner")

df

       city  temperature  humidity
0    mumbai           32        50
1     delhi           45        60
2  banglore           40        55

In [46]:
# Left Merge -- All data records in the left data frame and the common one from the right (ignore the records present on the right but not present on the left).

df = pd.merge(temperature_df, humidity_df, on="city", how="left")

df

        city  temperature  humidity
0     mumbai           32      50.0
1      delhi           45      60.0
2   banglore           40      55.0
3  hyderabad           36       NaN

In [51]:
# Left Merge -- All data records in the right data frame and common one from left (ignore the records present in left but not present in right).

df = pd.merge(temperature_df, humidity_df, on="city", how="right")

df

       city  temperature  humidity
0     delhi         45.0        60
1    mumbai         32.0        50
2  banglore         40.0        55
3   chennai          NaN        70

In [55]:
exdf = pd.read_excel("liver.xlsx")  # you need to place this file in working directory. If its not in working directoy you need to give ful path. 

exdf

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No

In [56]:
csvdf = pd.read_csv("liver.csv")

csvdf

   Age  Gender   TB   DB   TP LiverPatient
0   65  Female  0.7  0.1  6.8          Yes
1   62    Male  7.3  4.1  7.0          Yes
2   62    Male  7.3  4.1  7.0          Yes
3   58    Male  1.0  0.4  6.8          Yes
4   72    Male  3.9  2.0  NaN          Yes
5   46    Male  1.8  0.7  7.6          Yes
6   26  Female  0.9  0.2  4.5           No
7   29  Female  4.5  0.3  6.3          Yes
8   17    Male  0.9  0.3  5.4           No
9   29    Male  3.6  0.1  NaN           No